Revit 2027 API
RebarConstraint.GetTargetElement Method
 Gets the Element object (either Host or Rebar) which provides the target reference at index 0 for this constraint. Will throw exception if it's a multi target constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element GetTargetElement()
Public Function GetTargetElement As Element
public:
Element^ GetTargetElement()
member GetTargetElement : unit -> Element
Return Value
Element
 Returns the Element object (either Host or Rebar) which provides the target reference at index 0 for this constraint.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- Multi target constraint. Consider using the indexed version of the method. -or- The RebarConstraint should not be of RebarConstraintType 'ToSurface'. -or- The RebarConstraintType of the RebarConstraint is 'ToCustomTarget'.
See Also
Reference
RebarConstraint Class
GetTargetElement Overload
Autodesk.Revit.DB.Structure Namespace